# pandas数据处理

## 1、删除重复元素

使用duplicated()函数检测重复的行，返回元素为布尔类型的Series对象，每个元素对应一行，如果该行不是第一次出现，则元素为True

    - keep参数：指定保留哪一重复的行数据

- 创建具有重复元素行的DataFrame

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
#创建一个df
np.random.seed(10)
df = DataFrame(np.random.randint(0,100,size=(6,5)))
df

    0   1   2   3   4
0   9  15  64  28  89
1  93  29   8  73   0
2  40  36  16  11  54
3  88  62  33  72  78
4  49  51  54  77  69
5  13  25  13  92  86

In [7]:
#手动将df的某几行设置成相同的内容
df.iloc[1] = [4,4,4,4,4]
df.iloc[3] = [4,4,4,4,4]
df.iloc[4] = [4,4,4,4,4]
df

    0   1   2   3   4
0   9  15  64  28  89
1   4   4   4   4   4
2  40  36  16  11  54
3   4   4   4   4   4
4   4   4   4   4   4
5  13  25  13  92  86

- 使用duplicated查看所有重复元素行

In [11]:
df.duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

- 删除重复元素的行

In [14]:
indexs = df.loc[df.duplicated()].index

In [15]:
df.drop(labels=indexs,axis=0)

    0   1   2   3   4
0   9  15  64  28  89
1   4   4   4   4   4
2  40  36  16  11  54
5  13  25  13  92  86

- 使用drop_duplicates()函数删除重复的行
    - drop_duplicates(keep='first/last'/False)

In [17]:
df.drop_duplicates()

    0   1   2   3   4
0   9  15  64  28  89
1   4   4   4   4   4
2  40  36  16  11  54
5  13  25  13  92  86

## 2. 映射

### 1) replace()函数：替换元素

使用replace()函数，对values进行映射操作

#### Series替换操作

- 单值替换
    - 普通替换
    - 字典替换(推荐）
- 多值替换
    - 列表替换
    - 字典替换（推荐）
- 参数
    - to_replace:被替换的元素

单值普通替换

单值字典替换

多值列表替换

多值字典替换

replace参数说明：

- method：对指定的值使用相邻的值填充替换
- limit：设定填充次数

#### DataFrame替换操作

- 单值替换
    - 普通替换：  替换所有符合要求的元素:to_replace=15,value='e'
    - 按列指定单值替换： to_replace={列标签：替换值} value='value'
    
    
- 多值替换
    - 列表替换: to_replace=[]  value=[]
    - 字典替换（推荐）  to_replace={to_replace:value,to_replace:value}

In [19]:
df

    0   1   2   3   4
0   9  15  64  28  89
1   4   4   4   4   4
2  40  36  16  11  54
3   4   4   4   4   4
4   4   4   4   4   4
5  13  25  13  92  86

In [20]:
df.replace(to_replace=9,value='nine')

      0   1   2   3   4
0  nine  15  64  28  89
1     4   4   4   4   4
2    40  36  16  11  54
3     4   4   4   4   4
4     4   4   4   4   4
5    13  25  13  92  86

In [21]:
df.replace(to_replace=4,value='four')

      0     1     2     3     4
0     9    15    64    28    89
1  four  four  four  four  four
2    40    36    16    11    54
3  four  four  four  four  four
4  four  four  four  four  four
5    13    25    13    92    86

In [22]:
df.replace(to_replace={4:444})

     0    1    2    3    4
0    9   15   64   28   89
1  444  444  444  444  444
2   40   36   16   11   54
3  444  444  444  444  444
4  444  444  444  444  444
5   13   25   13   92   86

In [23]:
df

    0   1   2   3   4
0   9  15  64  28  89
1   4   4   4   4   4
2  40  36  16  11  54
3   4   4   4   4   4
4   4   4   4   4   4
5  13  25  13  92  86

In [29]:
df.columns = ['a','b','c','d','e']
df

    a   b   c   d   e
0   9  15  64  28  89
1   4   4   4   4   4
2  40  36  16  11  54
3   4   4   4   4   4
4   4   4   4   4   4
5  13  25  13  92  86

In [34]:
#按列指定单值替换： to_replace={列标签(显示索引)：替换值} value='value'
df.replace(to_replace={'c':4},value=444)

    a   b    c   d   e
0   9  15   64  28  89
1   4   4  444   4   4
2  40  36   16  11  54
3   4   4  444   4   4
4   4   4  444   4   4
5  13  25   13  92  86

**注意**：DataFrame中，无法使用method和limit参数

============================================

练习19：

    假设张三李四的课表里有满分的情况，老师认为是作弊，把所有满分的情况（包括150,300分）都记0分，如何实现？

============================================

### 2) map()函数：新建一列 ，   map函数并不是df的方法，而是series的方法

- map()可以映射新一列数据
- map()中可以使用lambd表达式
- map()中可以使用方法，可以是自定义的方法

    eg:map({to_replace:value})
- **注意** map()中不能使用sum之类的函数，for循环

- 新增一列：给df中，添加一列，该列的值为中文名对应的英文名

  name salary dep 
1
2

In [36]:
dic = {
    'name':['alex','jay','tom'],
    'salary':[5000,6000,9000],
    'dep':['sal','dev','sal']
}
df = DataFrame(data=dic)
df

   name  salary  dep
0  alex    5000  sal
1   jay    6000  dev
2   tom    9000  sal

In [37]:
df['name'].map({'alex':'李杰','tom':'张三','jay':'周杰伦'})

0     李杰
1    周杰伦
2     张三
Name: name, dtype: object

In [38]:
df['c_name'] = df['name'].map({'alex':'李杰','tom':'张三','jay':'周杰伦'})
df

   name  salary  dep c_name
0  alex    5000  sal     李杰
1   jay    6000  dev    周杰伦
2   tom    9000  sal     张三

#### map当做一种运算工具，至于执行何种运算，是由map函数的参数决定的（参数：lambda，函数）
- 使用自定义函数

In [44]:
df['salary'].map(lambda s:s-(s-3000)*0.5)

0    4000.0
1    4500.0
2    6000.0
Name: salary, dtype: float64

In [ ]:
df['salary'].map(lab)

In [41]:
#超过3000部分的钱缴纳50%的税
df['salary'].map(aflter_salary)

0    4000.0
1    4500.0
2    6000.0
Name: salary, dtype: float64

In [40]:
def aflter_salary(s):
    if s >= 3000:
        return s-(s-3000)*0.5
    return s

In [42]:
df['after_salary'] = df['salary'].map(aflter_salary)
df

   name  salary  dep c_name  after_salary
0  alex    5000  sal     李杰        4000.0
1   jay    6000  dev    周杰伦        4500.0
2   tom    9000  sal     张三        6000.0

- 使用lambda表达式

### 注意：并不是任何形式的函数都可以作为map的参数。只有当一个函数具有一个参数且有返回值，那么该函数才可以作为map的参数。

============================================

练习20：

    新增两列，分别为张三、李四的成绩状态，如果分数低于90，则为"failed"，如果分数高于120，则为"excellent"，其他则为"pass"
    
    【提示】使用函数作为map的参数

============================================

## 3. 使用聚合操作对数据异常值检测和过滤

使用df.std()函数可以求得DataFrame对象每一列的标准差

- 创建一个1000行3列的df 范围（0-1），求其每一列的标准差

In [45]:
df1 = DataFrame(np.random.random(size=(1000,3)))
df1

            0         1         2
0    0.182631  0.826082  0.105402
1    0.283577  0.065563  0.056444
2    0.765456  0.011788  0.611943
3    0.331882  0.559648  0.335500
4    0.411183  0.076856  0.853043
5    0.439987  0.121954  0.731735
6    0.138782  0.766880  0.831990
7    0.309778  0.597582  0.872392
8    0.983021  0.467403  0.875744
9    0.296069  0.131291  0.842818
10   0.659036  0.595440  0.436354
11   0.356250  0.587131  0.149471
12   0.171239  0.397165  0.637952
13   0.372520  0.002407  0.548816
14   0.126972  0.079793  0.235039
15   0.659965  0.214953  0.203047
16   0.382865  0.224873  0.114649
17   0.583017  0.232641  0.556518
18   0.523811  0.350958  0.705332
19   0.820704  0.134563  0.604726
20   0.283148  0.506408  0.038460
21   0.332444  0.000273  0.664655
22   0.377441  0.747582  0.140576
23   0.388049  0.866492  0.956853
24   0.486554  0.105933  0.340037
25   0.835571  0.465442  0.092856
26   0.854694  0.337258  0.606147
27   0.112665  0.543920  0.720799
28   0.865815  0.146701  0.103381
29   0.490555  0.029180  0.594861
..        ...       ...       ...
970  0.988324  0.883887  0.904746
971  0.405734  0.438576  0.725089
972  0.347559  0.406330  0.966094
973  0.572725  0.771880  0.470909
974  0.124640  0.530547  0.137777
975  0.113567  0.261750  0.453141
976  0.832268  0.602182  0.274018
977  0.736204  0.489927  0.421251
978  0.092128  0.617197  0.828674
979  0.340043  0.183019  0.563047
980  0.005794  0.607792  0.852889
981  0.202211  0.134389  0.755017
982  0.300104  0.527879  0.958652
983  0.305683  0.486578  0.983668
984  0.268096  0.910168  0.140745
985  0.321585  0.545496  0.895942
986  0.086942  0.481227  0.285864
987  0.938491  0.468331  0.548681
988  0.656457  0.788108  0.458615
989  0.490269  0.005044  0.402842
990  0.716575  0.433773  0.740203
991  0.923693  0.321200  0.232661
992  0.889194  0.845106  0.274721
993  0.032794  0.900323  0.915266
994  0.694419  0.054816  0.909458
995  0.391759  0.369202  0.115135
996  0.989783  0.245672  0.692866
997  0.277226  0.733242  0.895717
998  0.529584  0.743175  0.948999
999  0.621590  0.472716  0.641261

[1000 rows x 3 columns]

In [48]:
s_std = df1.std(axis=0)
s_std

0    0.287680
1    0.281544
2    0.287325
dtype: float64

对df应用筛选条件,去除标准差太大的数据:假设过滤条件为 C列数据大于两倍的C列标准差

In [50]:
df1[1] < 2*s_std[1]

0      False
1       True
2       True
3       True
4       True
5       True
6      False
7      False
8       True
9       True
10     False
11     False
12      True
13      True
14      True
15      True
16      True
17      True
18      True
19      True
20      True
21      True
22     False
23     False
24      True
25      True
26      True
27      True
28      True
29      True
       ...
970    False
971     True
972     True
973    False
974     True
975     True
976    False
977     True
978    False
979     True
980    False
981     True
982     True
983     True
984    False
985     True
986     True
987     True
988    False
989     True
990     True
991     True
992    False
993    False
994     True
995     True
996     True
997    False
998    False
999     True
Name: 1, Length: 1000, dtype: bool

In [51]:
df1.loc[df1[1] < 2*s_std[1]]

            0         1         2
1    0.283577  0.065563  0.056444
2    0.765456  0.011788  0.611943
3    0.331882  0.559648  0.335500
4    0.411183  0.076856  0.853043
5    0.439987  0.121954  0.731735
8    0.983021  0.467403  0.875744
9    0.296069  0.131291  0.842818
12   0.171239  0.397165  0.637952
13   0.372520  0.002407  0.548816
14   0.126972  0.079793  0.235039
15   0.659965  0.214953  0.203047
16   0.382865  0.224873  0.114649
17   0.583017  0.232641  0.556518
18   0.523811  0.350958  0.705332
19   0.820704  0.134563  0.604726
20   0.283148  0.506408  0.038460
21   0.332444  0.000273  0.664655
24   0.486554  0.105933  0.340037
25   0.835571  0.465442  0.092856
26   0.854694  0.337258  0.606147
27   0.112665  0.543920  0.720799
28   0.865815  0.146701  0.103381
29   0.490555  0.029180  0.594861
30   0.205845  0.202803  0.844126
31   0.061566  0.499231  0.248467
32   0.327144  0.002916  0.295442
33   0.986889  0.238333  0.733396
35   0.210696  0.517844  0.949670
37   0.345302  0.065498  0.220628
39   0.577664  0.168353  0.037972
..        ...       ...       ...
940  0.496046  0.495529  0.325196
942  0.521609  0.212985  0.081260
948  0.234595  0.251982  0.468777
953  0.846432  0.230190  0.678720
954  0.597962  0.293046  0.087717
957  0.242775  0.356760  0.968059
958  0.616881  0.088769  0.083696
959  0.756027  0.204700  0.884551
965  0.067454  0.176510  0.562239
966  0.264169  0.369199  0.475597
967  0.302792  0.254872  0.986701
971  0.405734  0.438576  0.725089
972  0.347559  0.406330  0.966094
974  0.124640  0.530547  0.137777
975  0.113567  0.261750  0.453141
977  0.736204  0.489927  0.421251
979  0.340043  0.183019  0.563047
981  0.202211  0.134389  0.755017
982  0.300104  0.527879  0.958652
983  0.305683  0.486578  0.983668
985  0.321585  0.545496  0.895942
986  0.086942  0.481227  0.285864
987  0.938491  0.468331  0.548681
989  0.490269  0.005044  0.402842
990  0.716575  0.433773  0.740203
991  0.923693  0.321200  0.232661
994  0.694419  0.054816  0.909458
995  0.391759  0.369202  0.115135
996  0.989783  0.245672  0.692866
999  0.621590  0.472716  0.641261

[604 rows x 3 columns]

============================================

练习21：

    新建一个形状为10000*3的标准正态分布的DataFrame(np.random.randn)，去除掉所有满足以下情况的行：其中任一元素绝对值(df.abs())大于3倍标准差

============================================

## 4. 排序

#### 使用.take()函数排序

    - take()函数接受一个索引列表，用数字表示,使得df根据列表中索引的顺序进行排序
    - eg:df.take([1,3,4,2,5])

可以借助np.random.permutation()函数随机排序

In [54]:
df

   name  salary  dep c_name  after_salary
0  alex    5000  sal     李杰        4000.0
1   jay    6000  dev    周杰伦        4500.0
2   tom    9000  sal     张三        6000.0

In [55]:
df.take([1,0,2],axis=0)

   name  salary  dep c_name  after_salary
1   jay    6000  dev    周杰伦        4500.0
0  alex    5000  sal     李杰        4000.0
2   tom    9000  sal     张三        6000.0

- np.random.permutation(x)可以生成x个从0-(x-1)的随机数列

In [61]:
n = np.random.permutation(3)
df.take(n,axis=0)

   name  salary  dep c_name  after_salary
1   jay    6000  dev    周杰伦        4500.0
2   tom    9000  sal     张三        6000.0
0  alex    5000  sal     李杰        4000.0

#### 随机抽样

当DataFrame规模足够大时，直接使用np.random.permutation(x)函数，就配合take()函数实现随机抽样

## 5. 数据分类处理【重点】

数据聚合是数据处理的最后一步，通常是要使每一个数组生成一个单一的数值。

数据分类处理：

 - 分组：先把数据分为几组
 - 用函数处理：为不同组的数据应用不同的函数以转换数据
 - 合并：把不同组得到的结果合并起来
 
数据分类处理的核心：
     - groupby()函数
     - groups属性查看分组情况
     - eg: df.groupby(by='item').groups

### 分组

In [2]:
from pandas import DataFrame,Series

In [79]:
df = DataFrame({'item':['Apple','Banana','Orange','Banana','Orange','Apple'],
                'price':[4,3,3,2.5,4,2],
               'color':['red','yellow','yellow','green','green','green'],
               'weight':[12,20,50,30,20,44]})
df

     item  price   color  weight
0   Apple    4.0     red      12
1  Banana    3.0  yellow      20
2  Orange    3.0  yellow      50
3  Banana    2.5   green      30
4  Orange    4.0   green      20
5   Apple    2.0   green      44

- 使用groupby实现分组

In [63]:
df.groupby(by='item',axis=0)

In [64]:
df.groupby(by='item',axis=0).groups

{'Apple': Int64Index([0, 5], dtype='int64'),
 'Banana': Int64Index([1, 3], dtype='int64'),
 'Orange': Int64Index([2, 4], dtype='int64')}

- 使用groups查看分组情况

In [72]:
#该函数可以进行数据的分组，但是不显示分组情况

In [73]:
#使用goups属性查看分组情况

- 分组后的聚合操作：分组后的成员中可以被进行运算的值会进行运算，不能被运算的值不进行运算

In [66]:
df

     item  price   color  weight
0   Apple    4.0     red      12
1  Banana    3.0  yellow      20
2  Orange    3.0  yellow      50
3  Banana    2.5   green      30
4  Orange    4.0   green      20
5   Apple    2.0   green      44

In [68]:
#给df创建一个新列，内容为各个水果的平均价格
df.groupby(by='item',axis=0).mean()['price']

item
Apple     3.00
Banana    2.75
Orange    3.50
Name: price, dtype: float64

In [69]:
df.groupby(by='item',axis=0)['price'].mean()

item
Apple     3.00
Banana    2.75
Orange    3.50
Name: price, dtype: float64

计算出苹果的平均价格

In [70]:
df.groupby(by='item',axis=0)['price'].mean()['Apple']

3.0

In [ ]:
df.groupby(by='item',axis=0)['price'].mean()['Apple']

按颜色查看各种颜色的水果的平均价格

In [73]:
df.groupby(by='item',axis=0).loc['Apple','price'].mean()

AttributeError: Cannot access callable attribute 'loc' of 'DataFrameGroupBy' objects, try using the 'apply' method

汇总:将各种颜色水果的平均价格和df进行汇总

In [78]:
 df.groupby(by='color',axis=0)['price'].mean()

color
green     2.833333
red       4.000000
yellow    3.000000
Name: price, dtype: float64

In [80]:
df

     item  price   color  weight
0   Apple    4.0     red      12
1  Banana    3.0  yellow      20
2  Orange    3.0  yellow      50
3  Banana    2.5   green      30
4  Orange    4.0   green      20
5   Apple    2.0   green      44

In [81]:
df['color'].map({'red':4,'green':2.83,'yellow':3})

0    4.00
1    3.00
2    3.00
3    2.83
4    2.83
5    2.83
Name: color, dtype: float64

In [82]:
df['mean_price'] = df['color'].map({'red':4,'green':2.83,'yellow':3})
df

     item  price   color  weight  mean_price
0   Apple    4.0     red      12        4.00
1  Banana    3.0  yellow      20        3.00
2  Orange    3.0  yellow      50        3.00
3  Banana    2.5   green      30        2.83
4  Orange    4.0   green      20        2.83
5   Apple    2.0   green      44        2.83

## 6.0 高级数据聚合

#### 使用groupby分组后，也可以使用transform和apply提供自定义函数实现更多的运算

 - df.groupby('item')['price'].sum() <==> df.groupby('item')['price'].apply(sum)
 - transform和apply都会进行运算，在transform或者apply中传入函数即可
 - transform和apply也可以传入一个lambda表达式

In [83]:
#求出各种水果价格的平均值
df.groupby(by='item')['price'].mean()

item
Apple     3.00
Banana    2.75
Orange    3.50
Name: price, dtype: float64

In [84]:
df

     item  price   color  weight  mean_price
0   Apple    4.0     red      12        4.00
1  Banana    3.0  yellow      20        3.00
2  Orange    3.0  yellow      50        3.00
3  Banana    2.5   green      30        2.83
4  Orange    4.0   green      20        2.83
5   Apple    2.0   green      44        2.83

In [89]:
df.groupby(by='item')['price'].groups

{'Apple': Int64Index([0, 5], dtype='int64'),
 'Banana': Int64Index([1, 3], dtype='int64'),
 'Orange': Int64Index([2, 4], dtype='int64')}

In [86]:
#使用apply函数求出水果的平均价格

df.groupby(by='item')['price'].apply(my_mean)

item
Apple     3.00
Banana    2.75
Orange    3.50
Name: price, dtype: float64

In [85]:
def my_mean(s):
    print(s)
    sum = 0
    for i in s:
        sum += i
    return sum/s.size

In [87]:
#使用transform函数求出水果的平均价格
df.groupby(by='item')['price'].transform(my_mean)

0    3.00
1    2.75
2    3.50
3    2.75
4    3.50
5    3.00
Name: price, dtype: float64